/*Создать переменные всех пройденных типов данных, и инициализировать их значения*/
public class Myclass {
    public static void main(String[] args) {
        int a=5;
        byte b=6;
        char c ='A';
        long v=50L;//содержит больший диапозон чисел в отличии от int;
        double d=4.4;
        boolean bool=true;//false
        short k=23;
        float f=120.0f;//также содержит больший диапозон чисел
        String dog="MAKS";
        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        System.out.println(v);
        System.out.println(d);
        System.out.println(bool);
        System.out.println(k);
        System.out.println(f);
        System.out.println(dog);


    }
}
