/*Написать метод, которому в качестве параметра передаётся целое число, метод должен
напечатать в консоль положительное число передали или отрицательное.(Замечание:
ноль считаем положительным числом*/

public class Myclass {
    public static void main(String[] args) {
        int  val=-7;
        if (val < 0)
        System.out.println("Число отрицательное " + val);
        else
                    System.out.println("Число положительное " + val);

    }
}
