/*Написать метод, которому в качестве параметра передаётся строка, обозначающая имя, метод должен вывести в консоль
сообщения "Привет, + указаноое имя!"*/

import java.util.Scanner;

public class Myclass {
    public static void main(String[] args) {
        String Line=readStringArgument("Андрей");

    }

    private static String readStringArgument(String userText) {
        Scanner userInput=new Scanner(System.in);
        System.out.println("Привет " +userText +"!");
        String name=userInput.nextLine();
        return name;
