/*Написать метод, вычисляющий выражение ф*(b+(c/d)) и возвращающий результат, где a,b,c,d - входные параметры этого метода*/
public class Myclass {
   public static void main(String[] args) {
       int Sum=getSum(6,3,4,2);
        System.out.println(Sum);
    }

   private static int getSum(int a,int b,int c,int d) {
        return a*(b+(c/d));
    }

  }
